---
type: StructuralSectionColdFormed
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 3
tags: [revit-api, class]
---

# StructuralSectionColdFormed

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | InnerFillet | 2016 | `public double InnerFillet { get ; set ; }` |
| Property | WallDesignThickness | 2016 | `public double WallDesignThickness { get ; set ; }` |
| Property | WallNominalThickness | 2016 | `public double WallNominalThickness { get ; set ; }` |